"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая вернет результат сложения цифр целого числа

ПРИМЕРЫ
--------------------------------------------------------------------------------
num_sum(5216) -> 14
num_sum(58716) -> 27
num_sum(321) -> 6
"""


def num_sum(numb: int) -> int:
    result = 0
    while numb > 0:
        last_digit = numb % 10  # извлекаем последнюю цифру числа - остаток от деления
        result += last_digit
        numb = numb // 10  # делим нацело, чтобы отбросить дробную часть
    return result


if __name__ == '__main__':
    assert num_sum(5216) == 14
    print('Решено!')
